validation/steady/300K/10atm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pyroFoam;

startFrom       latestTime;

//startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         0.100;

deltaT          1e-6;

maxDeltaT       1e-6;

writeControl    adjustableRunTime;

writeInterval   1.e-3;

//writeControl    timeStep;

// writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;


// ************************************************************************* //
