validation/steady/300K/10atm/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  laminar<psiChemistryCombustion>;
//combustionModel  bananas;

active  true;

laminarCoeffs
{
  
}

infinitelyFastChemistryCoeffs
{
    C       10.0;
}

PaSRCoeffs
{
    Cmix                Cmix [ 0 0 0 0 0 0 0 ] 0.1;
    turbulentReaction   on;
}


// ************************************************************************* //
