validation/steady/300K/10atm/constant/reactions
species
(
    EMp
    EMs
    EMg
);

reactions
{
    gasReaction
    {
        type        irreversiblethirdBodyArrheniusReaction;
        reaction    "EMg = EMp";
//        A           0.05472; // Ward
        A           0.84524; // Weber
        beta        2.0;
        Ta          0.;
        defaultEfficiency    1;
        thirdBodyEfficiencies
        {
            coeffs
            3
            (
                (EMp 1)
                (EMg 1)
                (EMs 0)
            );
        }
    }
}
